cf_billing/Documents/энргУстановитьНазначениеПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьНазначениеПУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргНазначенияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргНазначениеПУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргУстановитьНазначениеПУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииУстановитьВидБлагоустройстваАбонента(КомандыСоздатьНаОсновании);

КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;

	ДобавитьТекстЗапросаНазначенияПриборовУчета(Схема, Регистры);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаНазначенияПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНазначенияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргУстановитьНазначениеПУ.Дата КАК Период,
	|	энргУстановитьНазначениеПУ.Район КАК Район,
	|	энргУстановитьНазначениеПУ.Организация КАК Организация,
	|	энргУстановитьНазначениеПУТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргУстановитьНазначениеПУТочкиУчета.НазначениеПУ КАК НазначениеПУ,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	Документ.энргУстановитьНазначениеПУ.ТочкиУчета КАК энргУстановитьНазначениеПУТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьНазначениеПУ КАК энргУстановитьНазначениеПУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргУстановитьНазначениеПУ.КлючПомещения = энргКлючиПомещений.Ссылка
	|		ПО энргУстановитьНазначениеПУТочкиУчета.Ссылка = энргУстановитьНазначениеПУ.Ссылка
	|ГДЕ
	|	энргУстановитьНазначениеПУ.Ссылка В(&мДокументы)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
